<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta name="viewport" content="width=device-width, initial-scale=0.8"/><title>3&nbsp;设计思路</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-style.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-racket.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript" src="manual-racket.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">&#29992;Racket&#20570;&#19968;&#20010;&#25340;&#22270;&#28216;&#25103;</a></td></tr></table></div><div class="tocviewsublisttop" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right">1&nbsp;</td><td><a href="qianyan.html" class="tocviewlink" data-pltdoc="x">&#21069;&#35328;</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="shejimubiao.html" class="tocviewlink" data-pltdoc="x">&#35774;&#35745;&#30446;&#26631;</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#35774;&#35745;&#24605;&#36335;</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="bianchengshixian.html" class="tocviewlink" data-pltdoc="x">&#32534;&#31243;&#23454;&#29616;</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9658;</a></td><td>3&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#35774;&#35745;&#24605;&#36335;</a></td></tr></table><div class="tocviewsublistbottom" style="display: none;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right">3.1&nbsp;</td><td><a href="#%28part._tupiancaozuogongneng%29" class="tocviewlink" data-pltdoc="x">&#22270;&#29255;&#25805;&#20316;&#21151;&#33021;</a></td></tr><tr><td align="right">3.2&nbsp;</td><td><a href="#%28part._jiemiansheji%29" class="tocviewlink" data-pltdoc="x">&#30028;&#38754;&#21151;&#33021;&#35774;&#35745;</a></td></tr></table></div></div></div><div class="tocsub"><div class="tocsubtitle">On this page:</div><table class="tocsublist" cellspacing="0"><tr><td><span class="tocsublinknumber">3.1<tt>&nbsp;</tt></span><a href="#%28part._tupiancaozuogongneng%29" class="tocsubseclink" data-pltdoc="x">&#22270;&#29255;&#25805;&#20316;&#21151;&#33021;</a></td></tr><tr><td><span class="tocsublinknumber">3.2<tt>&nbsp;</tt></span><a href="#%28part._jiemiansheji%29" class="tocsubseclink" data-pltdoc="x">&#30028;&#38754;&#21151;&#33021;&#35774;&#35745;</a></td></tr></table></div></div><div class="maincolumn"><div class="main"><div class="versionbox"><span class="version">8.9</span></div><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="shejimubiao.html" title="backward to &quot;2 设计目标&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;用Racket做一个拼图游戏&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="bianchengshixian.html" title="forward to &quot;4 编程实现&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3>3<tt>&nbsp;</tt><a name="(part._shejisilu)"></a>&#35774;&#35745;&#24605;&#36335;</h3><p>&#25340;&#22270;&#26412;&#36136;&#19978;&#23601;&#26159;&#23558;&#19968;&#24352;&#23436;&#25972;&#30340;&#22270;&#29255;&#36890;&#36807;&#34892;&#21015;&#20998;&#21106;&#25104;&#30456;&#21516;&#22823;&#23567;&#30340;&#23567;&#22359;&#65292;&#28982;&#21518;&#25171;&#20081;&#37325;&#25490;&#65292;&#24182;&#23558;&#37325;&#25490;&#21518;&#30340;&#22270;&#20687;&#23637;&#31034;&#32473;&#29992;&#25143;&#65292;&#26377;&#29992;&#25143;&#37325;&#26032;&#24674;&#22797;&#25340;&#21512;&#30340;&#36807;&#31243;&#12290;</p><p>&#30001;&#27492;&#65292;&#25105;&#20204;&#25226;&#28216;&#25103;&#20998;&#20026;&#20004;&#22823;&#37096;&#20998;&#65292;&#19968;&#37096;&#20998;&#26159;&#23558;&#22270;&#29255;&#20998;&#21106;&#25171;&#20081;&#30340;&#36807;&#31243;&#65292;&#36825;&#37096;&#20998;&#24037;&#20316;&#22312;&#21518;&#21488;&#23436;&#25104;&#65307;&#21478;&#19968;&#37096;&#20998;&#26159;&#23558;&#25171;&#20081;&#37325;&#25490;&#30340;&#22270;&#29255;&#23637;&#31034;&#32473;&#29992;&#25143;&#65292;&#30001;&#29992;&#25143;&#37325;&#26032;&#25340;&#21512;&#30340;&#20132;&#20114;&#36807;&#31243;&#65292;&#36825;&#37096;&#20998;&#36890;&#36807;&#22270;&#24418;&#30028;&#38754;&#21644;&#29992;&#25143;&#20132;&#20114;&#23436;&#25104;&#12290;</p><p>&#22312;Racket&#20013;&#26159;&#21487;&#20197;&#30452;&#25509;&#36890;&#36807;&#22312;&#20132;&#20114;&#26639;&#20869;&#26174;&#31034;&#32467;&#26524;&#30340;&#65292;&#36825;&#20010;&#32467;&#26524;&#21487;&#20197;&#20351;&#25991;&#26412;&#20869;&#23481;&#65292;&#20063;&#21487;&#20197;&#26159;&#22270;&#24418;&#20869;&#23481;&#65292;&#36825;&#23601;&#32473;&#35843;&#35797;&#26377;&#22270;&#24418;&#36755;&#20986;&#30340;&#31243;&#24207;&#25552;&#20379;&#20102;&#26497;&#22823;&#30340;&#20415;&#21033;&#12290;</p><p>&#26377;&#20102;&#36825;&#20010;&#20415;&#21033;&#65292;&#25105;&#20204;&#21487;&#20197;&#20808;&#25226;&#26377;&#20851;&#22270;&#29255;&#25805;&#20316;&#30340;&#30456;&#20851;&#20989;&#25968;&#20840;&#37096;&#20808;&#20889;&#20986;&#26469;&#65292;&#28982;&#21518;&#25226;&#36825;&#20123;&#20989;&#25968;&#36827;&#34892;&#25353;&#38656;&#32452;&#21512;&#65292;&#23601;&#33021;&#23454;&#29616;&#20102;&#25105;&#20204;&#38656;&#35201;&#30340;&#31243;&#24207;&#8212;&#8212;&#36825;&#23601;&#26159;&#33258;&#24213;&#21521;&#19978;&#30340;&#31243;&#24207;&#35774;&#35745;&#12290;&#28982;&#21518;&#25105;&#20204;&#35774;&#35745;&#22909;GUI&#20013;&#30340;&#30456;&#24212;&#21151;&#33021;&#30028;&#38754;&#65292;&#25226;&#30456;&#24212;&#30340;&#21151;&#33021;&#19968;&#20010;&#20010;&#21644;GUI&#21151;&#33021;&#30028;&#38754;&#36830;&#25509;&#65292;&#23601;&#23436;&#25104;&#20102;&#25972;&#20010;&#28216;&#25103;&#20102;&#8212;&#8212;&#36825;&#23601;&#26159;&#33258;&#39030;&#21521;&#19979;&#30340;&#31243;&#24207;&#35774;&#35745;&#12290;</p><p>&#22909;&#20102;&#65292;&#25105;&#20204;&#20808;&#26469;&#30475;&#30475;&#24213;&#23618;&#38656;&#27714;&#26377;&#21738;&#20123;&#65311;</p><h4>3.1<tt>&nbsp;</tt><a name="(part._tupiancaozuogongneng)"></a>&#22270;&#29255;&#25805;&#20316;&#21151;&#33021;</h4><p>&#20855;&#20307;&#27599;&#20010;&#21151;&#33021;&#23545;&#24212;&#21738;&#20010;&#20989;&#25968;&#65292;&#21518;&#32493;&#31243;&#24207;&#35774;&#35745;&#37096;&#20998;&#21487;&#20197;&#30475;&#21040;&#65292;&#20063;&#21487;&#20197;&#23545;&#24212;&#28304;&#20195;&#30721;&#35828;&#26126;&#12290;</p><ul><li><p>&#21462;&#24471;&#28304;&#22270;&#29255;&#8212;&#8212;&#20174;&#23384;&#20648;&#20171;&#36136;&#20013;&#35835;&#21462;&#22270;&#29255;&#65307;</p></li><li><p>&#35774;&#32622;&#25340;&#22270;&#22270;&#29255;&#23610;&#23544;&#8212;&#8212;&#32473;&#23450;&#19968;&#20010;&#25340;&#22270;&#22270;&#29255;&#22823;&#23567;&#30340;&#23610;&#23544;&#65307;</p></li><li><p>&#35843;&#25972;&#22270;&#29255;&#22823;&#23567;&#8212;&#8212;&#35835;&#21462;&#30340;&#22270;&#29255;&#19981;&#19968;&#23450;&#26159;&#38656;&#35201;&#30340;&#23610;&#23544;,&#38656;&#35201;&#26681;&#25454;&#38656;&#35201;&#36827;&#34892;&#35843;&#25972;&#65307;</p></li><li><p>&#35774;&#32622;&#21333;&#20803;&#26684;&#34892;&#25968;&#21015;&#25968;&#8212;&#8212;&#36825;&#20010;&#29992;&#26469;&#20998;&#21106;&#25340;&#22270;&#22270;&#29255;&#65292;&#34892;&#21015;&#25968;&#36234;&#22810;&#25340;&#36215;&#26469;&#36234;&#22797;&#26434;&#65307;</p></li><li><p>&#35843;&#25442;&#21333;&#20803;&#26684;&#8212;&#8212;&#23558;&#20998;&#21106;&#30340;&#22270;&#29255;&#20013;&#30340;&#25351;&#23450;&#20004;&#20010;&#21333;&#20803;&#26684;&#35843;&#25442;&#65292;&#36825;&#26159;&#25171;&#20081;&#25340;&#22270;&#30340;&#22522;&#30784;&#65292;&#23545;&#25152;&#26377;&#21333;&#20803;&#26684;&#36827;&#34892;&#35843;&#25442;&#23601;&#23454;&#29616;&#20102;&#25171;&#20081;&#21333;&#20803;&#26684;&#30340;&#21151;&#33021;&#65307;</p></li><li><p>&#35774;&#32622;&#28151;&#21512;&#22270;&#29255;&#8212;&#8212;&#23558;&#25171;&#20081;&#28151;&#21512;&#30340;&#21508;&#20010;&#21333;&#20803;&#26684;&#22270;&#22359;&#32452;&#21512;&#25104;&#19968;&#24352;&#24453;&#25340;&#22270;&#65292;&#36825;&#20010;&#29992;&#26469;&#23637;&#31034;&#32473;&#29992;&#25143;&#65307;</p></li><li><p>&#37325;&#32622;&#28151;&#21512;&#22270;&#29255;&#8212;&#8212;&#32771;&#34385;&#21040;&#29992;&#25143;&#21487;&#33021;&#35273;&#24471;&#26174;&#31034;&#20986;&#26469;&#30340;&#25340;&#22270;&#19981;&#22815;&#20081;&#65292;&#21487;&#20197;&#20877;&#26469;&#25171;&#20081;&#19968;&#27425;&#65307;</p></li><li><p>&#24674;&#22797;&#28151;&#21512;&#22270;&#8212;&#8212;&#32771;&#34385;&#21040;&#29992;&#25143;&#25340;&#21040;&#21322;&#36884;&#35273;&#24471;&#27809;&#36807;&#30270;&#65292;&#38656;&#35201;&#20877;&#25340;&#19968;&#27425;&#25340;&#36807;&#30340;&#25340;&#22270;&#65292;&#20877;&#32473;&#20182;&#19968;&#27425;&#26426;&#20250;&#65307;</p></li><li><p>&#32472;&#21046;&#28151;&#21512;&#22270;&#29255;&#8212;&#8212;&#25226;&#28151;&#21512;&#25340;&#22270;&#32472;&#21046;&#20986;&#26469;&#65307;</p></li><li><p>&#32472;&#21046;&#30446;&#26631;&#22270;&#29255;&#8212;&#8212;&#36825;&#20010;&#29992;&#26469;&#32473;&#29992;&#25143;&#19968;&#20010;&#23436;&#25104;&#30340;&#30446;&#26631;&#22270;&#29255;&#23567;&#26679;&#20316;&#20026;&#21442;&#29031;&#65292;&#21487;&#20197;&#25552;&#31034;&#25110;&#24341;&#23548;&#29992;&#25143;&#23436;&#25104;&#25340;&#22270;&#25805;&#20316;&#65307;</p></li><li><p>&#26681;&#25454;&#22352;&#26631;&#20301;&#32622;&#36716;id&#8212;&#8212;&#22240;&#20026;&#25105;&#20204;&#20351;&#29992;&#40736;&#26631;&#25805;&#20316;&#65292;&#36825;&#37324;&#25226;&#40736;&#26631;&#20809;&#26631;&#20301;&#32622;&#36716;&#25442;&#25104;&#21333;&#20803;&#26684;&#22270;&#29255;&#30340;&#26631;&#24535;&#21495;&#65288;ID&#21495;&#12290;&#20855;&#20307;&#20026;&#20160;&#20040;&#35201;&#29992;ID&#21495;&#65292;&#19979;&#36793;&#19987;&#38376;&#20570;&#35299;&#37322;&#65289;&#65307;</p></li><li><p>&#32472;&#21046;&#31354;&#30333;&#21333;&#20803;&#26684;&#8212;&#8212;&#25226;&#21333;&#20803;&#26684;&#22270;&#22359;&#31227;&#36208;&#20102;&#65292;&#36824;&#27809;&#26377;&#22635;&#20805;&#22270;&#29255;&#30340;&#29366;&#24577;&#65292;&#23601;&#30041;&#19979;&#31354;&#30333;&#21333;&#20803;&#26684;&#65292;&#36825;&#26159;&#20026;&#20102;&#20132;&#20114;&#21160;&#30011;&#32780;&#38656;&#35201;&#30340;&#65292;&#20855;&#20307;&#21407;&#22240;&#19979;&#36793;&#35299;&#37322;&#65307;</p></li><li><p>&#22312;&#25351;&#23450;&#21333;&#20803;&#26684;&#20301;&#32622;&#32472;&#21046;&#25351;&#23450;&#21333;&#20803;&#26684;&#20869;&#23481;&#8212;&#8212;&#36825;&#20010;&#27604;&#36739;&#30452;&#30333;&#65292;&#23601;&#26159;&#22312;&#25351;&#23450;&#30340;&#21333;&#20803;&#26684;&#25226;&#25351;&#23450;&#30340;&#22270;&#22359;&#30011;&#19978;&#65307;</p></li><li><p>&#22312;&#25351;&#23450;&#22352;&#26631;&#20301;&#32622;&#32472;&#21046;&#25351;&#23450;&#21333;&#20803;&#26684;&#8212;&#8212;&#25226;&#19968;&#20010;&#21333;&#20803;&#26684;&#30340;&#22270;&#22359;&#31227;&#21040;&#20102;&#20854;&#20182;&#21333;&#20803;&#26684;&#25918;&#19978;&#65292;&#23601;&#24471;&#22312;&#37027;&#20010;&#20301;&#32622;&#19978;&#25226;&#26032;&#30340;&#22270;&#22359;&#30011;&#20986;&#26469;&#65307;</p></li><li><p>&#32472;&#21046;&#28966;&#28857;&#21333;&#20803;&#26684;&#8212;&#8212;&#22914;&#26524;&#40736;&#26631;&#31227;&#21040;&#26576;&#20010;&#21333;&#20803;&#26684;&#19978;&#65292;&#32473;&#20986;&#19968;&#20010;&#26694;&#20570;&#25552;&#31034;&#65307;</p></li><li><p>&#32472;&#21046;&#22833;&#28966;&#21333;&#20803;&#26684;&#8212;&#8212;&#22914;&#26524;&#40736;&#26631;&#31227;&#20986;&#26576;&#20010;&#21333;&#20803;&#26684;,&#28165;&#38500;&#28966;&#28857;&#25552;&#31034;;</p></li><li><p>&#21462;&#24471;&#24403;&#21069;&#21333;&#20803;&#26684;id&#8212;&#8212;&#36890;&#36807;&#32473;&#23450;&#21333;&#20803;&#26684;&#34892;&#21015;&#21495;&#24471;&#21040;&#21333;&#20803;&#26684;ID&#21495;&#65307;</p></li><li><p>&#25351;&#23450;&#30340;id&#26377;&#25928;&#8212;&#8212;&#21028;&#26029;&#32473;&#20986;&#30340;ID&#21495;&#26159;&#21542;&#23646;&#20110;&#25340;&#22270;&#22270;&#22359;&#21015;&#34920;&#20013;&#30340;&#65292;&#38450;&#27490;&#35823;&#32473;&#20986;ID&#21495;&#65307;</p></li><li><p>&#26681;&#25454;&#25302;&#21160;&#30340;&#22352;&#26631;&#20301;&#32622;&#21028;&#26029;&#21333;&#20803;&#26684;id&#8212;&#8212;&#24403;&#29992;&#40736;&#26631;&#25353;&#20303;&#19968;&#20010;&#21333;&#20803;&#26684;&#22270;&#22359;&#24182;&#25302;&#21160;&#30340;&#26102;&#20505;&#65292;&#38656;&#35201;&#38543;&#26102;&#30693;&#36947;&#25302;&#21040;&#21738;&#20010;&#20301;&#32622;&#20102;&#65292;&#20197;&#20415;&#20110;&#21518;&#32493;&#30340;&#25805;&#20316;&#65307;</p></li><li><p>&#21028;&#26029;&#26159;&#21542;&#25104;&#21151;&#23436;&#25104;&#25340;&#22270;&#8212;&#8212;&#23436;&#25104;&#25340;&#22270;&#20102;&#21527;&#65311;&#36825;&#20010;&#38656;&#35201;&#38543;&#26102;&#26816;&#26597;&#21028;&#26029;&#19968;&#19979;&#65292;&#24456;&#22810;&#26102;&#20505;&#25340;&#27809;&#25340;&#23545;&#29992;&#25143;&#26159;&#26080;&#27861;&#21028;&#26029;&#30340;&#65292;&#22240;&#20026;&#22270;&#22359;&#20043;&#38388;&#22826;&#30456;&#20284;&#20102;&#65307;</p></li><li><p>&#21021;&#22987;&#21270;&#25340;&#22270;&#25968;&#25454;&#8212;&#8212;&#27599;&#20010;&#31243;&#24207;&#24320;&#22987;&#20043;&#21069;&#65292;&#38590;&#20813;&#35201;&#20570;&#20123;&#20934;&#22791;&#65292;&#36825;&#20010;&#23601;&#24178;&#36825;&#20010;&#30340;&#12290;</p></li></ul><p>&#22823;&#33268;&#23601;&#26159;&#36825;&#20123;&#21543;&#65292;&#22914;&#26524;&#26377;&#38656;&#35201;&#65292;&#21518;&#32493;&#36824;&#21487;&#20197;&#28155;&#21152;&#12290;</p><p>***&#35299;&#37322;&#20004;&#20010;&#38382;&#39064;&#65292;&#24403;&#28982;&#23545;&#20110;&#29087;&#31995;&#30340;&#26379;&#21451;&#26469;&#35828;&#24182;&#19981;&#19968;&#23450;&#38656;&#35201;&#12290;***
&#20026;&#20160;&#20040;&#35201;&#23545;&#27599;&#20010;&#22270;&#22359;&#26631;&#35760;ID&#21495;&#65311;</p><p>&#36825;&#28041;&#21450;&#21040;&#25968;&#25454;&#32467;&#26500;&#38382;&#39064;&#12290;&#25968;&#25454;&#32467;&#26500;&#25105;&#20204;&#22312;&#19979;&#36793;&#20570;&#19968;&#20010;&#31616;&#30053;&#35828;&#26126;&#65292;&#36825;&#37324;&#19981;&#20570;&#21465;&#36848;&#65292;&#21333;&#23601;ID&#21495;&#30340;&#20316;&#29992;&#20570;&#19968;&#20010;&#35828;&#26126;&#12290;
&#24517;&#39035;&#30340;&#26159;&#65292;&#27599;&#20010;&#21333;&#20803;&#26684;&#22270;&#22359;&#37117;&#35201;&#21807;&#19968;&#36827;&#34892;&#26631;&#35760;&#25165;&#33021;&#25805;&#20316;&#65292;&#36825;&#26159;&#27809;&#26377;&#30097;&#38382;&#30340;&#12290;&#26412;&#26469;&#21333;&#20803;&#26684;&#22270;&#22359;&#30452;&#25509;&#29992;&#34892;&#21495;&#21450;&#21015;&#21495;&#23601;&#21487;&#20197;&#34920;&#31034;&#65292;&#20063;&#33021;&#22815;&#21807;&#19968;&#26631;&#35782;&#65292;&#20294;&#26159;&#22312;&#29992;&#25143;&#25340;&#22270;&#30340;&#26102;&#20505;&#65292;&#24635;&#20250;&#35843;&#26469;&#35843;&#21435;&#65292;&#20301;&#32622;&#19968;&#23450;&#20250;&#25171;&#20081;&#30340;&#65292;&#36825;&#26679;&#25105;&#20204;&#23601;&#26080;&#27861;&#37325;&#26032;&#23450;&#20301;&#22270;&#22359;&#22312;&#21407;&#22270;&#19978;&#30340;&#20301;&#32622;&#65288;&#21407;&#22270;&#20301;&#32622;&#30340;&#19968;&#20010;&#29992;&#22788;&#26159;&#21028;&#26029;&#25340;&#22270;&#26159;&#21542;&#23436;&#25104;&#65289;&#65292;&#20063;&#19981;&#33021;&#23450;&#20301;&#21018;&#25171;&#20081;&#30340;&#26102;&#20505;&#30340;&#20301;&#32622;&#65288;&#20026;&#20102;&#24674;&#22797;&#28151;&#21512;&#22270;&#65292;&#38656;&#35201;&#35760;&#20303;&#25171;&#20081;&#26102;&#30340;&#20301;&#32622;&#65289;&#65292;&#32780;&#19988;&#37319;&#29992;&#26631;&#24535;ID&#21495;&#20063;&#27604;&#36739;&#31616;&#21333;&#12290;
&#20132;&#20114;&#21160;&#30011;&#26159;&#22914;&#20309;&#23454;&#29616;&#30340;?</p><p>&#22823;&#23478;&#24212;&#35813;&#37117;&#28165;&#26970;&#25105;&#20204;&#30475;&#30340;&#24433;&#35270;&#21160;&#30011;&#37117;&#26159;&#22312;&#22266;&#23450;&#26102;&#38388;&#37324;&#36890;&#36807;&#26174;&#31034;&#38745;&#24577;&#22270;&#29255;&#23454;&#29616;&#30340;&#65288;&#27604;&#22914;&#27599;&#31186;&#38047;&#26174;&#31034;24&#24103;&#65289;&#12290;
&#22312;&#25105;&#20204;&#31243;&#24207;&#30340;&#20132;&#20114;&#21160;&#30011;&#37324;&#36793;&#20063;&#21487;&#20197;&#26159;&#19968;&#24103;&#19968;&#24103;&#30011;&#38754;&#26174;&#31034;&#12290;&#27604;&#22914;&#40736;&#26631;&#27599;&#31227;&#21160;&#19968;&#27425;&#65292;&#30011;&#38754;&#21047;&#26032;&#26174;&#31034;&#19968;&#27425;&#65288;&#26681;&#25454;&#40736;&#26631;&#31227;&#21160;&#24773;&#20917;&#38543;&#26426;&#21457;&#29983;&#65289;&#12290;&#21487;&#20197;&#36825;&#26679;&#26469;&#21306;&#20998;&#65292;&#20110;&#24433;&#35270;&#21160;&#30011;&#26159;&#22266;&#23450;&#26102;&#38388;&#21464;&#25442;&#24103;&#21160;&#30011;&#65292;&#31243;&#24207;&#20132;&#20114;&#21160;&#30011;&#26159;&#38543;&#26426;&#21464;&#25442;&#24103;&#21160;&#30011;&#12290;&#22312;&#20132;&#20114;&#21160;&#30011;&#20013;&#65292;&#24456;&#22810;&#26102;&#20505;&#25105;&#20204;&#23454;&#38469;&#21482;&#28041;&#21450;&#22270;&#20687;&#37324;&#36793;&#30340;&#24456;&#23567;&#19968;&#22359;&#22270;&#20687;&#30340;&#21464;&#21270;&#65292;&#20026;&#20102;&#22686;&#21152;&#21464;&#25442;&#25928;&#29575;&#65292;&#20943;&#23569;&#27599;&#27425;&#21464;&#21270;&#35745;&#31639;&#26426;&#38656;&#35201;&#24212;&#23545;&#30340;&#25968;&#25454;&#37327;&#65292;&#21487;&#20197;&#25226;&#21407;&#20132;&#20114;&#22270;&#20687;&#20316;&#20026;&#32972;&#26223;&#65292;&#20462;&#25913;&#22270;&#20687;&#20013;&#21464;&#21270;&#30340;&#37027;&#19968;&#22359;&#22270;&#20687;&#65292;&#36825;&#26679;&#21487;&#25552;&#21319;&#20132;&#20114;&#25805;&#20316;&#30340;&#23454;&#26102;&#24615;&#12290;</p><h4>3.2<tt>&nbsp;</tt><a name="(part._jiemiansheji)"></a>&#30028;&#38754;&#21151;&#33021;&#35774;&#35745;</h4><p>&#39318;&#20808;&#65292;&#32943;&#23450;&#38656;&#35201;&#19968;&#20010;&#22270;&#29255;&#26174;&#31034;&#21306;&#22495;&#26469;&#26174;&#31034;&#25340;&#22270;&#65307;</p><p>&#20854;&#27425;&#65292;&#38656;&#35201;&#19968;&#24352;&#32553;&#30053;&#22270;&#32473;&#20104;&#29992;&#25143;&#25552;&#31034;&#23436;&#25104;&#30340;&#30446;&#26631;&#22270;&#20687;&#65307;</p><p>&#28982;&#21518;&#23601;&#26159;&#25552;&#20379;&#32473;&#29992;&#25143;&#30340;&#19968;&#20123;&#25805;&#20316;&#21151;&#33021;&#65292;&#26242;&#26102;&#32771;&#34385;&#21151;&#33021;&#65288;&#23454;&#29616;&#25511;&#20214;&#65289;&#26377;&#65306;&#36873;&#25321;&#22270;&#29255;&#65288;&#25353;&#38062;&#65289;&#12289;&#28151;&#21512;&#25340;&#22270;&#65288;&#25353;&#38062;&#65289;&#12289;&#20877;&#26469;&#19968;&#27425;(&#25353;&#38062;)&#12289;&#36864;&#20986;(&#25353;&#38062;)&#12289;&#34892;&#25968;&#35774;&#32622;&#65288;&#25991;&#26412;&#26694;&#65289;&#12289;&#21015;&#25968;&#35774;&#32622;(&#25991;&#26412;&#26694;)&#12289;&#34892;&#21015;&#25968;&#36873;&#25321;&#31561;&#65288;&#19979;&#25289;&#21015;&#34920;&#26694;&#65289;&#12290;</p><p>&#22914;&#19978;&#25152;&#36848;&#65292;&#25105;&#20204;&#21487;&#20197;&#23558;&#22270;&#24418;&#26694;&#26550;&#30028;&#38754;&#21010;&#20998;&#20026;&#20197;&#19979;4&#20010;&#21306;&#22495;&#65306;&#32553;&#30053;&#22270;&#26174;&#31034;&#21306;&#12289;&#25340;&#22270;&#26174;&#31034;&#21306;&#12289;&#25805;&#20316;&#21151;&#33021;&#21306;&#12289;&#20449;&#24687;&#26174;&#31034;&#21306;&#12290;&#22914;&#19979;&#65306;</p><p><img src="%E5%9B%BE%E5%BD%A2%E6%A1%86%E6%9E%B6%E7%95%8C%E9%9D%A2.png" alt="" width="648" height="432"/></p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="shejimubiao.html" title="backward to &quot;2 设计目标&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;用Racket做一个拼图游戏&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="bianchengshixian.html" title="forward to &quot;4 编程实现&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>